Enums/ПоставщикиEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПоставщикиEDI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>EXITE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COMARCH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DIGMA</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Edisoft</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭмуляторEDI</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ТК_ОбменEDI_ПовтИсп/Ext/Module.bsl
Функция КаталогВыгрузкиFTP(Провайдер,Подразделение) Экспорт
	КаталогФТП ="";
	
	Если Провайдер = Перечисления.ПоставщикиEDI.EXITE Тогда
		КаталогФТП =  "/outbox/";
	ИначеЕсли Провайдер = Перечисления.ПоставщикиEDI.COMARCH Тогда
		Если Справочники.ПодразделенияКомпании.ЭтоБаффит(Подразделение) Тогда
			КаталогФТП = "/Buffet/IN/ORDERS/";
		Иначе
			КаталогФТП = "/IN/ORDERS/";
		КонецЕсли;
	КонецЕсли;
	
	Возврат КаталогФТП;
	
КонецФункции


Функция КаталогЗагрузкиFTP(Провайдер,Подразделение=Неопределено) Экспорт
	КаталогФТП ="";
	
	Если Провайдер = Перечисления.ПоставщикиEDI.EXITE Тогда
		КаталогФТП =  "/inbox/";
	ИначеЕсли Провайдер = Перечисления.ПоставщикиEDI.COMARCH Тогда
		Если Справочники.ПодразделенияКомпании.ЭтоБаффит(Подразделение) Тогда
			КаталогФТП = "/Buffet/OUT/DESADV/";
		Иначе
			КаталогФТП = "/OUT/DESADV/";
		КонецЕсли;
	КонецЕсли;
	
	Возврат КаталогФТП;
	
КонецФункции


Функция КомандыEDIФормы(Форма, МодульПодсистемы, Направление, ТолькоВМенюЕще) Экспорт
	
	Возврат ТК_ОбменEDI.КомандыEDIФормы(Форма, МодульПодсистемы, Направление, ТолькоВМенюЕще);
	
КонецФункции
